<?php
$siteRegex = [
    'iask.sina.com.cn' => 'div.list-text-con>pre',
    'zhidao.baidu.com' => 'div.line.content>div',
    'www.zhongkao.com' => 'div.content>p',
];
$filterRegex = [
    '/[^<>]*你对这个回答的评价是[^<>]*/u',

    '/[^<>]*点击查看[^<>]*/u',
    '/[^<>]*微信支付[^<>]*/u',
    '/[^<>]*扫码支付[^<>]*/u',
    '/[^<>]*推荐阅读[^<>]*/u',
    '/[^<>]*展开全部[^<>]*/u',
    '/[^<>]*猜你喜欢[^<>]*/u',


    '/[^<>]*公众号[^<>]*/u',
    '/[^<>]*中考网[^<>]*/u',
    '/[^<>]*支付宝[^<>]*/u',
    '/[^<>]*已赞过[^<>]*/u',
    '/[^<>]*已踩过[^<>]*/u',



    '/[^<>]*关注[^<>]*/u',
    '/[^<>]*转载[^<>]*/u',
    '/[^<>]*择要[^<>]*/u',
    '/[^<>]*支付[^<>]*/u',
    '/[^<>]*商户[^<>]*/u',
    '/[^<>]*订单[^<>]*/u',
    '/[^<>]*钉钉[^<>]*/u',
    '/[^<>]*评论[^<>]*/u',
    '/[^<>]*收起[^<>]*/u',
    '/[^<>]*来源[^<>]*/u',
    '/[^<>]*笔者[^<>]*/u',
    '/[^<>]*追问[^<>]*/u',
    '/[^<>]*追答[^<>]*/u',


    '/<span[^<>]*>[\d\w]{10,}<\/span>/si',  // 百度知道
    '/<[\w]+>(<br *\/*>)*<\/[\w]+>/si', // 空行
    '/\-{2,}/i',
    '/(&nbsp;){2,}/i',
];
